app/controllers/anzeige_controller.rb

  def index
    @users = Users.find :all
    @assessment_event = AssessmentEvent.find :all
---
SELECT * FROM `users`
SELECT * FROM `assessment_events`

  def show
    @assessment_event = AssessmentEvent.find params[:id]
---
SELECT * FROM `assessment_events` WHERE (`assessment_events`.`id` = -612493518)