app/controllers/assessment_event_controller.rb

SELECT * FROM `assessment_events`
SELECT * FROM `nutzers`
SELECT * FROM `induction_problems`
---
  def index
    @assessment_event = AssessmentEvent.find :all
    @nutzer = Nutzer.find :all
    @induction_problem = InductionProblem.find :all

SELECT * FROM `assessment_events` WHERE (`assessment_events`.`id` = 2)
SELECT * FROM `nutzers` WHERE (`nutzers`.`id` = 1)
SELECT * FROM `assessment_events` WHERE (`assessment_events`.`userName` = 'rebholz')
SELECT * FROM `induction_problems` WHERE (`induction_problems`.`assessmentEventId` = 1)
---
  def show
    @assessment_event = AssessmentEvent.find params[:id]
    @nutzer = Nutzer.find params[:id]
    @nutzer = Nutzer.find @assessment_event.userName
    @induction_problem = InductionProblem.find params[:id]