app/controllers/induction_problem_controller.rb

SELECT * FROM `induction_problems`
---
  def index
    @induction_problem = InductionProblem.find :all