app/controllers/induction_solution_controller.rb

SELECT * FROM `induction_solutions`
---
  def index
    @induction_solution = InductionSolution.find :all

SELECT * FROM `induction_solutions` WHERE (`induction_solutions`.`id` = 2)
---
  def show
    @induction_solution = InductionSolution.find params[:id]