app/controllers/interaction_event_controller.rb

SELECT * FROM `interaction_events`
---
  def index
    @interaction_event = InteractionEvent.find :all