app/controllers/manual_feedback_event_controller.rb

SELECT * FROM `manual_feedback_events`
---
  def index
    @manual_feedback_event = ManualFeedbackEvent.find :all