app/controllers/nutzer_controller.rb

  def index
    @nutzer = Nutzer.find :all
---
SELECT * FROM `nutzers`

  def show
    @nutzer = Nutzer.find params[:id]
---
SELECT * FROM `nutzers` WHERE (`nutzers`.`id` = 0)