app/controllers/pages_controller.rb

  def index
    @pages = Page.find :all
---
SELECT * FROM `pages`

  def show
    @page = Page.find params[:id]
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 88)