app/controllers/property_controller.rb

  def index
    @property = Property.find :all
---
SELECT * FROM `properties`