app/controllers/users_controller.rb

  def index
    @users = Users.find :all
---
SELECT * FROM `users`