app/controllers/user_roles_controller.rb

  def index
    @user_roles = UserRoles.find :all
---
SELECT * FROM `user_roles`